[
  {
    "id": 1,
    "title": "Senior Java Developer",
    "company": "Kambi - provides business-to-business services to the sports betting industry.",
    "location": "Sweden",
    "date": "Mar 2025 - Present",
    "description": "I work with a team responsible for a customer-facing, close to realtime API, which providees a range of information about the betting services they use. I also maintain and enhance the infrastructure it uses, and liaise regularly with other teams who maintain systems we interface with.",
    "achievements": [
      "Developing key features that allow customers to easily access historical data that was previously unavailable.",
      "Improving the CI/CD developer experience, introducing tools to work more easily with local test databases.",
      "Working closely with one of the data teams to successfully trial a new process for self-service data product creation."
    ]
  },
  {
    "id": 2,
    "title": "Senior Full-Stack Developer",
    "company": "Allakando - provides a platform for tutoring and babysitting services.",
    "location": "Sweden",
    "date": "Aug 2023 - Feb 2025",
    "description": "I was responsible for the development of the platform, including the backend, frontend and infrastructure. As part of the development team, I worked closely with the product team to deliver new features and improvements to the platform. I also worked with the operations team to ensure the platform was stable and scalable.",
    "achievements": [
      "Designed and implemented an organisation-wide date/time policy to resolve consistency issues and bugs in applications and third party services.",
      "Drove the development of key CI/CD pipelines to make them simpler, more reliable and faster to run.",
      "Played a key role in designing, planning and implementing the approach to migrating a legacy application to the current tech stack.",
      "Rewrote the majority of MVP backend code, making it more maintainable, scalable and production-ready."
    ]
  },
  {
    "id": 3,
    "title": "Consultant Backend Developer",
    "company": "Devoteam Creative Tech - a consultancy that provides software development services to clients in a variety of industries.",
    "location": "Sweden",
    "date": "Sep 2022 - Jul 2023",
    "description": "I worked on a range of client projects, and the role required a high level of technical expertise, the ability to pick up new technologies quickly, and to work with a range of stakeholders.",
    "achievements": [
      "Completed the migration of a client's key application from MySQL to a MongoDB database.",
      "Maintained a complex legacy codebase utilising AWS (including Lambda and Step Functions, SQS, SNS, API Gateway and CloudFormation) and integrations with a large number of external systems.",
      "Built an IoT project to control the air quality in meeting rooms.",
      "Supported business development by providing technical input to bid documents and estimates."
    ]
  },
  {
    "id": 4,
    "title": "Volunteer Backend Developer",
    "company": "The Climate App - a non-profit organisation that provides a platform for users to track their carbon footprint and take action to reduce it.",
    "location": "Remote",
    "date": "Sep 2022 - Jul 2023",
    "description": "I worked as a volunteer on the project, developing the Spring Boot/PostgreSQL service used by the iOS and Android apps."
  },
  {
    "id": 5,
    "title": "Developer",
    "company": "Mumsnet - an extremely popular parenting website that provides a platform for parents to share advice and information.",
    "location": "UK",
    "date": "Nov 2020 - Aug 2022",
    "description": "I worked across the stack, developing new features and maintaining the existing codebase.",
    "achievements": [
      "Implemented the administration functionality of the Mumsnet forums.",
      "Optimised SQL and scripts to migrate millions of records to a new database structure, reducing run time from hours to minutes.",
      "Migrated the application to a new tech stack."
    ]
  },
  {
    "id": 6,
    "title": "Other relevant experience",
    "location": "UK",
    "date": "",
    "description": "Prior roles include teaching ICT to physically disabled people, working with computer models of SONAR systems, educational quality assurance, and ecommerce consultancy. These positions have given me an excellent blend of technical and soft skills, which I continue to use extensively in my day-to-day work."
  }
]